#!/usr/bin/python3
# -*- coding: utf-8 -*-
# @author : liuhefei
# @Time : 2019/6/4 1:18
# @desc: 求车速

if __name__=="__main__":
    a = [0, 0, 0, 0, 0]  # 列表a用来存放分解后的五个数字
    i = 95860  # i为里程数初始值
    while 1:
        # 从高到低分解当前i中保存的五位数，并顺次存放在数组元素a[0]~a[4]中
        t = 0  # 列表a的下标
        k = 100000
        while k >= 10:
            a[t] = (i % k)//(k // 10)  # 保存分解后的数字
            k /= 10
            t += 1
        if a[0] == a[4] and a[1] == a[3]:
            print("里程表上出现的新的对称数为：%d%d%d%d%d" %(a[0],a[1],a[2],a[3],a[4]))
            print("该车的速度为：%.2f" %((i-95859)/2.0))
            break  # 跳出循环
        i += 1
